from app.preprocess.modules.normalize_text import clean_text

ZIP_TO_REGION_GU_MAP = {
    "11110": "종로구", "11140": "중구", "11170": "용산구",
    "11200": "성동구", "11215": "광진구", "11230": "동대문구",
    "11260": "중랑구", "11290": "성북구", "11305": "강북구",
    "11320": "도봉구", "11350": "노원구", "11380": "은평구",
    "11410": "서대문구", "11440": "마포구", "11470": "양천구",
    "11500": "강서구", "11530": "구로구", "11545": "금천구",
    "11560": "영등포구", "11590": "동작구", "11620": "관악구",
    "11650": "서초구", "11680": "강남구", "11710": "송파구",
    "11740": "강동구"
}

def zip_code_to_district_name(zip_code_raw: str) -> list:
    """
    우편번호를 정제하고 해당하는 행정구 이름 리스트로 반환.
    매핑 실패 시 빈 리스트 반환.
    """
    code = clean_text(zip_code_raw)
    return [ZIP_TO_REGION_GU_MAP[code]] if code in ZIP_TO_REGION_GU_MAP else []
